import urllib.request
import rsa
from rsa import PrivateKey

Private_Key = PrivateKey(8528460616836763783897561956462105596914954006532265911712311683380482486102630624564799783376409979607899614788126661049746076325444875429188307035856253, 65537, 4717284852225959185899364037440702624291119256859402159079165944772304041129781901475469050294402307285587354096391573497657995816080121983368308792273473, 4902009478631967923449653186935907234780556621710806720657636519983995645904895561, 1739788683398639716463012009651288258585394195066471998081771727246292373)

if __name__ == '__main__':
    print("Получение зашифрованного пути для загружки!")
    mybytes = ""
    crypto = ""
    try:
        fp = urllib.request.urlopen("http://127.0.0.1:8000/getdata/")
        mybytes = fp.read()
        fp.close()
    except BaseException:
        print("Произошла ошибка при загрузке данных с сервера, проверьте его работу!")
    print("Расшифровка пути!")
    try:
        crypto = rsa.decrypt(mybytes, Private_Key)
    except BaseException:
        print("Произошла ошибка при попытке расшифровки, проверьте правильность ключа!")
    print("Расшифровка успешна!")
    print("Загрузка и сохранение файла!")
    try:
        url = "http://127.0.0.1:8000/pages/"+crypto.decode("utf-8")
        urllib.request.urlretrieve(url, 'Spisok_podavshix.xlsx')
    except BaseException:
        print("Произошла ошибка при скачивании файла!")
    print("Загрузка успешна")